Revit 2026 API

# DimensionValue Property

---

The value of the dimension.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double? Value { get; }
```
```vb
Public ReadOnly Property Value As Double?
	Get
```
```cpp
public:
property Nullable<double> Value {
	Nullable<double> get ();
}
```
```fsharp
member Value : Nullable<float> with get
```

#### Property Value

NullableDouble

This nullable property will not have a value for spot dimensions or for linear dimensions with more than one segment.

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace